RIET/src/Enums/ТипыЗаказа/ТипыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаказа</name>
  <enumValues>
    <name>E</name>
  </enumValues>
  <enumValues>
    <name>I</name>
  </enumValues>
  <enumValues>
    <name>A</name>
  </enumValues>
  <enumValues>
    <name>R</name>
  </enumValues>
  <enumValues>
    <name>X</name>
  </enumValues>
  <enumValues>
    <name>S</name>
  </enumValues>
  <enumValues>
    <name>U</name>
  </enumValues>
  <enumValues>
    <name>V</name>
  </enumValues>
  <enumValues>
    <name>RAN</name>
  </enumValues>
  <enumValues>
    <name>LOAN</name>
  </enumValues>
  <enumValues>
    <name>FMT</name>
  </enumValues>
  <enumValues>
    <name>FAT</name>
  </enumValues>
  <enumValues>
    <name>SS</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ТипыЗаказа/ManagerModule.bsl
Функция ПолучитьПоTMSId(Знач TMSId) Экспорт
	
	TMSId = ВРег(TMSId);
	
	Если TMSId = "EXPENSE" Тогда
		Возврат Перечисления.ТипыЗаказа.E;
		
	ИначеЕсли TMSID = "ASSET CONSTRUCTION (FTE)" Тогда
		Возврат Перечисления.ТипыЗаказа.V;
		
	ИначеЕсли TMSID = "ASSET CONSTRUCTION (NFTE)" Тогда
		Возврат Перечисления.ТипыЗаказа.U;
		
	ИначеЕсли TMSID = "ISSUED INVENTORY" Тогда
		Возврат Перечисления.ТипыЗаказа.I;
		
	ИначеЕсли TMSID = "NEW ASSET (FTE)" Тогда
		Возврат Перечисления.ТипыЗаказа.A;
		
	ИначеЕсли TMSID = "NEW ASSET (NFTE)" Тогда
		Возврат Перечисления.ТипыЗаказа.A;
		
	ИначеЕсли TMSID = "NEW INVENTORY" Тогда
		Возврат Перечисления.ТипыЗаказа.I;
		
	ИначеЕсли TMSID = "USED ASSET" Тогда
		Возврат Перечисления.ТипыЗаказа.FAT;
		
	Иначе
		Возврат Перечисления.ТипыЗаказа.E;
		
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьTMSId(ERPTreatment, Leg7 = Ложь) Экспорт
	
	ERPTreatments = Перечисления.ТипыЗаказа;
	
	Если ERPTreatment = ERPTreatments.E Тогда
		Возврат "EXPENSE";
		
	ИначеЕсли ERPTreatment = ERPTreatments.V Тогда
		Возврат "ASSET CONSTRUCTION (FTE)";
		
	ИначеЕсли ERPTreatment =  ERPTreatments.U Тогда
		Возврат "ASSET CONSTRUCTION (NFTE)";
		
	ИначеЕсли ERPTreatment = ERPTreatments.I Тогда
		Возврат ?(Leg7, "NEW INVENTORY", "ISSUED INVENTORY");
		
	ИначеЕсли ERPTreatment = ERPTreatments.A Тогда
		Возврат "NEW ASSET (FTE)";
						
	ИначеЕсли ERPTreatment = ERPTreatments.FAT Тогда
		Возврат "USED ASSET";
		
	Иначе
		Возврат "EXPENSE";
		
	КонецЕсли;	
	
КонецФункции
